<script lang="ts" setup>

</script>

<template>
    <view class="container">
        <view>全站去水印用户协议

            <br>欢迎来到全站去水印。《全站去水印用户协议》由宁波全站去水印络科技有限公司、与注册登录全站去水印官方网站https://www.aimissu.top/、全站去水印小程序的用户共同签署,您在注册平台用户或使用平台服务前，请您务必仔细阅读并充分理解本协议的各项条款内容。
            请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入全站去水印；进入全站去水印则意味着您将同意遵守本协议下全部规定，并服从全站去水印的统一管理。
            <br>第一章 总则
            <br>第1条 “全站去水印”（含图形LOGO）任何人未经全站去水印授权许可不得以任何形式擅自使用。
            <br>第2条 全站去水印是本人为网友提供的技术交流学习，是供网友在线解析、上传、下载、视频、图片的线上开放平台。
            <br>第3条 全站去水印所有权、经营权、管理权均属个人小程序（以下简称“全站去水印”）。
            <br>第4条 本协议最终解释权归属全站去水印。
            <br>第二章 全站去水印用户
            <br>第5条 凡是浏览用户均为全站去水印用户（以下统称“用户”）。
            <br>第6条 用户享有的权利与承担责任。
            <br>第7条
            <br>用户的言行不得违反《计算机信息网络国际联网安全保护管理办法》、《互联网信息服务管理办法》、《互联网电子公告服务管理规定》、《维护互联网安全的决定》、《互联网新闻信息服务管理规定》等相关法律规定，不得在全站去水印发布、传播或以其它方式传送含有下列内容之一的信息：
            &nbsp;（1） 反对宪法所确定的基本原则的；
            &nbsp;（2） 泄露国家秘密，破坏国家统一的；
            &nbsp;（3） 损害国家荣誉和利益的；
            &nbsp;（4） 煽动民族仇恨、民族歧视、破坏民族团结的；
            &nbsp;（5） 破坏国家宗教政策，宣扬邪教和封建迷信的；
            &nbsp;（6） 散布谣言，扰乱社会秩序，破坏社会稳定的；
            &nbsp;（7） 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            &nbsp;（8） 侮辱或者诽谤他人，侵害他人合法权利的；
            &nbsp;（9） 煽动非法集会、结社、聚众扰乱社会秩序的；
            <br>（10）以非法民间组织名义活动的；
            <br>（11）含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
            <br>（12） 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
            <br>（二）用户不得在全站去水印内发布任何形式的推广或营销信息。
            <br>（三）用户应承担一切因个人创建、上传不当全站去水印信息而直接或间接导致的民事或刑事法律责任，因用户行为给全站去水印造成损失的，用户应依法赔偿。
            <br>（四）全站去水印拥有对违反本协议的用户进行处理的权力，直至禁止其在创建及上传全站去水印，下载全站去水印，包括但不限于上传及下载文字、图片、视频、音频等任何形式的信息内容。
            <br>（五）任何用户不得随意创建或上传烈士、不得上传现往任国家领导人、不得随意创建或上传政治人物、争议类历史人物、网红明星等其他名人或公众人物任何全站去水印信息或个人信息，包括但不限于图片、文字、音频、视频等内容形式。
            <br>（六）任何用户发现全站去水印名称、全站去水印内信息包括文字、图片、视频、音频内容涉嫌侮辱或者诽谤他人、侵害他人名誉权等合法权益的或违反全站去水印协议的，有权到全站去水印投诉中心进行投诉。
            <br>第三章 权责声明
            <br>您在全站去水印开通使用的产品服务，根据合同条款或产品约定相应期限（月/季/年)，如未约定时间的最长使用期限不超过10年。到期如无特殊情况，可申请自动延期。（内容或产品需符合国家政策要求，国家政策或法律相关要求终止除外，最终解释权由全站去水印）
            <br>第13条
            <br>全站去水印是供网友在线分享文档、视频、音频的开放平台，为网友提供的信息存储空间，平台上所累积的文档、视频、音频，均来自热心用户的积极上传。全站去水印不会编辑或修改用户上传的文档、视频、音频内容。对于用户上传的文档内容之真实性引发的全部责任，由用户自行承担。全站去水印的用户不能侵犯包括他人的著作权在内的知识产权以及其他权利。一旦由于用户上传的文档、视频、音频发生权利纠纷或侵犯了任何第三方的合法权益，其责任由用户本人承担，因此给全站去水印或任何第三方造成损失的，用户应依法赔偿。
            <br>第14条
            <br>全站去水印用户不得侵犯包括他人的著作权在内的知识产权以及其他合法权利。如果由于用户上传的文档、视频、音频未经著作权人同意擅自对他人的作品进行全部或部分复制，修改，改编，翻译，汇编等，有可能侵害到他人的著作权时，不得把相关内容上传发布到全站去水印。具体内容见后文“全站去水印内容管理规范”。
            <br>第15条 全站去水印的用户可以为介绍、评论、研究等目的，在合理的范围内适当引用他人已经发表的作品，但应当明显标注作者姓名、作品名称等信息，不得以此牟利，或有其他侵犯著作权人及其他权利人的合法权益的行为。
            <br>第16条 用户承诺：其所上传的所有文档、视频、音频等内容符合中国法律法规和规范性文件的相关规定，不侵犯任何第三方的合法权益。如用户违反前述保证，全站去水印有权删除相关文档内容，并可以暂停或终止向该用户提供服务。
            <br>第17条 对于用户上传到全站去水印上的任何内容，用户同意全站去水印在全世界范围内享有免费的、永久的、不可撤销的、非排他性的使用和再许可的权利。全站去水印享有修改、复制、发行、表演、展览、信息网络传播、改编、翻译、汇编等权利。
            <br>第18条 如因全站去水印用户上传的内容侵犯了第三方的合法权利，第三方向全站去水印提出异议，全站去水印有权删除相关的内容。提出异议者和文档上传者之间的相关法律问题得到解决后，以此为依据，向全站去水印提出申请，全站去水印可以恢复的内容。
            <br>第19条
            <br>当权利人发现全站去水印的内容侵犯其合法权益时，权利人应事先向全站去水印发出“权利通知”，全站去水印将根据中国法律法规和规范性文件的规定采取移除相关内容等合理措施。为保证权利人合法权益，尽快解决问题，减少损失，创建合法合规文明和谐的上网环境，请按照全站去水印公示的具体内容和步骤发出权利通知书。
            <br>第20条 用户从全站去水印中获得的信息，未经事先许可，用户不得以盈利为目的自己或提供给第三方进行使用（符合法律规定的“合理使用”条件的除外）。否则，一切法律后果由该用户或第三方自负，与全站去水印无关。
            <br>第21条 未经全站去水印事先许可，禁止使用任何机器人、蜘蛛爬虫、其他自动设备，或手动程序来监视或复制全站去水印网页或其所包含的任何内容。否则，全站去水印有权依法追究法律责任。
            <br>第四章 处罚规则
            <br>第22条 全站去水印郑重提醒用户，若出现下列情况任意一种或几种，将承担包括被关闭全部或者部分权限、被暂停或其帐号的后果，情节严重的，还将承担相应的法律责任。
            <br>（1）、使用不雅或不恰当ID和昵称；
            <br>（2）、多次涉及侵犯他人著作权、名誉权等合法权利。
            <br>（3）、发表含有猥亵、色情、人身攻击和反政府言论等非法或侵权言论的；
            <br>（4）、从事非法商业活动；
            <br>（5）、模仿管理人员ID或者他人ID，用以假冒管理人员或破坏管理人员形象；
            <br>（6）、使用刷分软件等非法软件进行批量、作弊上传文档、视频、音频的行为。
            <br>（7）、其他全站去水印认为不恰当的情况。
            <br>第23条 凡文档出现以下情况之一，全站去水印管理人员有权不提前通知作者直接删除，并依照有关规定作相应处罚。情节严重者，全站去水印管理人员有权对其做出关闭部分权限、封禁直至删除其帐号。
            <br>（1）、发表含有本协议第7条禁止发布、传播内容的文档、视频、音频；
            <br>（2）、发表内容与主题无关，或者无内容的灌水、垃圾文档、视频、音频等内容；
            <br>（3）、同一文档、视频、音频等内容多次出现的；
            <br>（4）、违反本协议第8条的规定，发布广告的；
            <br>（5）、文档、视频、音频内容会包含有严重影响用户浏览的内容或格式的；
            <br>（6）、严禁用户以任何方式转让、出售自己的全站去水印账号与钱包其它虚拟产品，一经发现，全站去水印有权立即封禁该账号；
            <br>（7）、其他全站去水印认为不恰当的情况。
            <br>第五章 隐私保护
            <br>第24条
            <br>您在使用本服务/或产品的过程中，为了保证本服务/或产品的正常提供/运行，可能需要收集您的一些信息，您同意并授权全站去水印基于本服务/或产品的必要性获取并使用您的用户信息，不论是您主动提供的还是在使用本服务/或产品过程中全站去水印获取的信息。
            <br>第25条 全站去水印可能会统计您对本服务/或产品的使用情况。同时，全站去水印可能会与公众分享这些统计信息，以展示我们服务的整体使用趋势。这些统计信息不包含您的任何身份识别信息。
            <br>第26条 全站去水印会保证不向任何第三方共享您的个人隐私信息，以下情况除外：
            <br>（1）征得您的同意后，我们会与其他公司、组织和个人共享您的信息；
            <br>（2）在使用本服务/或产品的过程中，您向第三方分享的信息。
            <br>第27条 全站去水印不会在任何情况下分享您的个人隐私信息，但以下情况除外：
            <br>（1）事先获得您的授权；
            <br>（2）根据法律、法规、法律程序的要求或政府主管部门的强制性要求；
            <br>（3）在法律要求的范围内，为维护公共利益和全站去水印合法利益，例如查找、预防、处理欺诈或安全方面的问题；
            <br>（4）符合相关服务条款或使用协议的规定。

            <br>第28条 全站去水印将可能使用站内信、短信、消息等方式向您发送与本产品及服务有关的通知。如您不希望接收上述信息，可通过相应的退订功能进行退订。
            <br>第29条 全站去水印的隐私权保护声明说明了全站去水印如何收集和使用用户信息。您保证在您使用全站去水印的所有产品和服务前，已经充分了解并同意如上隐私声明。
            <br>第六章 在线修谱服务
            <br>第30条
            <br>本服务协议，仅供能够根据相关法律订立具有法律约束力的合约的个人或公司使用。因此，您的年龄必须在十八周岁以上，才可使用本公司服务。如不符合本项条件，请勿使用“服务”。全站去水印可随时自行全权决定拒绝向任何人士提供“服务”。
            <br>第31条
            <br>全站去水印主要通过公众号入口、微信小程序入口、全站去水印官网、全站去水印APP，为用户提供完整在线修谱服务。在线修谱服务内容包括：使用全站去水印网络服务平台搜索、上传、创建、分享、预览、下载、打印全站去水印信息；用户可获取平台信息服务、客服咨询服务、软件工具服务、商务交易咨询服务等。除非本协议另有其它明示规定，增加或强化目前本服务的任何新功能，包括所推出的新产品，均受到本协议之规范。
            <br>第32条 全站去水印查询秉承弘扬传统文化，助力寻根问祖的原则，为会员提供全站去水印免费查询、寻根免费发布服务。
            <br>第33条 全站去水印服务费用于全站去水印资料电子化整理及维护和技术开发。当您下载或查阅即视为完成服务，服务费用不再退还，感谢您为全站去水印数字化助力，弘扬中华优秀传统文化。
            <br>第34条 用户在全站去水印官方入口提供的任何用户信息，将受到国家法律法规及全站去水印的严格保护，详细条款请查阅后文“隐私政策”。
            <br>第35 条我们不会超期储存您的信息，当您选择退出、终止平台服务或我们不再向您提供服务，我们将对您的信息进行删除处理或使其匿名化。但存在以下情形的，我们按照法律法规要求合法保留相关信息：

            <br>法律法规规定的其他情形的,以下几种情况平台可继续使用：
            <br>若用户未删除其创建的全站去水印、注销账号后；
            <br>若用户发布的全站去水印为打赏可见且有用户为其付费后，删除该全站去水印；
            <br>用户发布的全站去水印为打赏可见且有用户为其付费后，更改全站去水印查看权限设置。
            <br>第七章 附则
            <br>第36条
            <br>您理解并且同意，为持续改善全站去水印为您提供的各项服务，除非有相反证明，您使用本平台服务上传、发布或传输内容即代表了您有权且同意在全世界范围内，永久性的、不可撤销的、免费的授予我方及其关联方对该内容的存储、使用、发布、复制、出版、翻译、据以创作衍生作品、传播、表演和展示等权利；将内容的全部或部分编入其他任何形式的作品、媒体、技术中的权利；对您的上传、发布的内容进行商业开发的权利；通过有线或无线网络向计算机终端、移动通讯终端（包括但不限于便携式通讯设备如手机和智能平板电脑等）、手持数字影音播放设备、电视接收设备（模拟信号接收设备、数字信号接收设备、数字电视、IPTV、电视机机顶盒、视频投影仪、车载电视、互联网电视/OTT终端、智能电视等带互联网接入功能的播放设备等）等提供信息的下载、点播、数据传输、移动视频业务（包括但不限于SMS、MMS、WAP、IVR、Streaming、3G、手机视频等无线服务）及其相关宣传和推广等服务的权利；以及再授权给其他第三方以上述方式使用的权利。
            <br>第37条 用户自行上传发表的文档、视频、音频而引起的法律纠纷，与全站去水印无关。
            <br>第38条 全站去水印如因系统维护或升级等而需暂停服务时，将事先公告。若因硬件故障或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，全站去水印不负任何责任。
            <br>第39条
            <br>全站去水印用户使用平台服务将被视为已同意并接受本协议，否则用户可拒绝我们提供的相关服务。我们将视情况修订本协议条款内容而无须事先通知,修订后的协议(以下称“修订协议”)将重新获得用户的同意，如用户对修订的协议不接受的,可选择停止/终止使用平台服务。如用户选择继续使用平台服务则视为已同意并接受修订后的协议。
            <br>第40条 本协议未涉及的问题参见国家有关法律法规，当本协议与国家法律法规冲突时，以国家法律法规为准。

            <br>全站去水印内容管控规范

            <br>遵循国家相关法律法规、结合全站去水印内容审核机制，我们对站内信息作出以下规范说明：

            <br>1、信息内容不得违反宪法确定的基本原则，煽动抗拒或者破坏宪法、法律、行政法规实施；危害国家统一、主权和领土完整，泄露国家秘密，危害国家安全，损害国家尊严、荣誉和利益，宣扬恐怖主义、极端主义。
            <br>2、信息内容不得煽动破坏国家宗教政策，宣扬宗教狂热，危害宗教和睦，伤害信教公民宗教感情，破坏信教公民和不信教公民团结，宣扬邪教、封建迷信。
            <br>3、信息内容不得诋毁民族优秀文化传统，煽动民族仇恨、民族歧视，侵害民族风俗习惯、歪曲民族历史和民族历史人物，损害革命领袖、英雄烈士形象，伤害民族感情，破坏民族团结。
            <br>4、信息内容不得危害社会公德，扰乱社会秩序，破坏社会稳定，宣扬淫秽色情、赌博、吸毒，渲染暴力、恐怖，教唆犯罪或者传授犯罪方法。
            <br>5、信息内容不得教唆、教授、组织他人进行违法乱纪活动，以非法民间组织名义活动的，宣传违法违规物品。
            <br>6、信息内容不得发布未经许可的与政治、经济、军事、外交等社会公共事务及突发事件有关的时政类新闻信息。
            <br>7、信息内容不得侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利；不得侵犯他人隐私，侮辱或者诽谤他人，侵害他人合法权益。
            <br>8、信息内容不得断章取义或以讹传讹，存在诋毁、人身攻击等负面影响。
            <br>9、信息内容不得侵害未成年人合法权益或者损害未成年人身心健康。
            <br>10、信息内容不得含有法律、行政法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容。
            <br>11、信息内容不得与事实相悖或违背科学常理，不得发布凭空杜撰、拼凑、编造或曲解事实，制造耸人听闻的谣言。
            <br>12、信息内容不得与事实不一致、关键信息不准确，或歪曲事实。
            <br>13、信息内容不得发布无资质的专业领域内容，包括：

            <br>（1）未申请健康类专业资质认证的个人和机构，不得发布疾病治疗、用药指导等健康领域专业性强的内容；
            <br>（2）未申请财经类专业资质认证的个人和机构，不得发布股票买卖指导、投资指南等财经领域专业性强的内容；
            <br>（3）我国法律法规要求必须取得特定资质方可从事特定行为的其他情形。
            <br>（4）以营利、获益为目的，推广可能会给他人带来严重经济损失的理财产品、投资项目等。包含但不限于股票、博彩（包含彩票、六合彩、赌球、跑马）、P2P、区块链、各种网赚等高风险投资产品。
            <br>14.信息内容不得进行违规推广，内容包括但不限于：
            <br>（1）借领导人/重大会议营销，借国家重大会议或领导人形象、名号等为企业或产品宣传推广。
            <br>（2）宣传传销组织、违规网贷，或不合规的汽车、烟草、彩票等相关推广行为。
            <br>15、信息内容不得发布血腥暴力场景或造成感官不适的密集恐惧场景。
            <br>16、信息内容不得发布以猎奇为目的描述或展现的灵异迷信场景。
            <br>17、任何展示在网站上的出版物（古代及近现代电子书籍）不得含有下列内容：
            <br>(一)反对宪法确定的基本原则的；
            <br>(二)危害国家统一、主权和领土完整的；
            <br>(三)泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
            <br>(四)煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
            <br>(五)宣扬邪教、迷信的；
            <br> (六)扰乱社会秩序，破坏社会稳定的；
            <br>(七)宣扬淫秽、赌博、暴力或者教唆犯罪的；
            <br>(八)侮辱或者诽谤他人，侵害他人合法权益的；
            <br>(九)危害社会公德或者民族优秀文化传统的；
            <br>(十)有法律、行政法规和国家规定禁止的其他内容的。
            <br>18、需承担停止侵害、消除影响、赔礼道歉、赔偿损失等民事责任的侵权行为：
            <br>（一）未经著作权人许可，发表其作品的；
            <br>（二）未经合作作者许可，将与他人合作创作的作品当作自己单独创作的作品发表的；
            <br>（三）没有参加创作，为谋取个人名利，在他人作品上署名的；
            <br>（四）歪曲、篡改他人作品的；
            <br>（五）剽窃他人作品的；
            <br>（六）未经著作权人许可，以展览、摄制视听作品的方法使用作品，或者以改编、翻译、注释等方式使用作品的，本法另有规定的除外；
            <br>（七）使用他人作品，应当支付报酬而未支付的；
            <br>（八）未经视听作品、计算机软件、录音录像制品的著作权人、表演者或者录音录像制作者许可，出租其作品或者录音录像制品的原件或者复制件的，本法另有规定的除外；
            <br>（九）未经出版者许可，使用其出版的图书、期刊的版式设计的；
            <br>（十）未经表演者许可，从现场直播或者公开传送其现场表演，或者录制其表演的；
            <br>（十一）其他侵犯著作权以及与著作权有关的权利的行为。
            <br>19、国家法律法规及相关政策文件禁止的其他内容。
            <br>隐私条款
            <br>全站去水印非常重视对您的个人隐私保护，有时候我们需要某些信息才能为您提供您请求的服务，本隐私政策解释了这些情况下的数据收集和使用情况。
            本政策适用于全站去水印的所有相关服务，随着全站去水印服务范围的扩大，隐私政策的内容可由全站去水印随时更新，且毋须另行通知。更新后的隐私政策一旦在网页上公布即有效代替原来的隐私政策。
            我们收集哪些信息
            通常，您能在匿名的状态下访问全站去水印并获取信息。当我们需要能识别您的个人信息或者可以与您联系的信息时，我们会征求您的同意。
            通常，在您注册全站去水印或申请开通新的功能时，我们可能收集这些信息：
            姓名、微信、电子邮箱地址、住址和电话号码，并征求您的确认。
            关于您的个人信息
            全站去水印严格保护您个人信息的安全。
            我们使用各种安全技术和程序来保护您的个人信息不被未经授权的访问、使用或泄漏。
            全站去水印会在法律要求或符合全站去水印的相关服务条款、软件许可使用协议约定的情况下透露您的个人信息，或者有充分理由相信必须这样做才能：
            <br>(a)满足法律或行政法规的明定，或者符合全站去水印站适用的法律程序；
            <br>(b)符合全站去水印相关服务条款、软件许可使用协议的约定；
            <br>(c)保护全站去水印的权利或财产；
            <br>(d)在紧急情况下保护全站去水印员工、全站去水印产品或服务的用户或大众的个人安全；
            全站去水印不会未经您的允许将这些信息与第三方共享，本政策已经列出的上述情况除外。
            <br> Cookie的使用
            <br>使用 Cookie 能帮助您实现您的联机体验的个性化，您可以接受或拒绝 Cookie ，大多数 Web 浏览器会自动接受 Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。
            全站去水印有时会使用 Cookie 以便知道哪些网站受欢迎，使您在访问全站去水印时能得到更好的服务。Cookie不会跟踪个人信息。
            当您注册全站去水印时，全站去水印亦会使用 Cookie。在这种情况下，全站去水印会收集并存储有用信息，当您再次访问全站去水印时，我们可辨认您的身份。来自全站去水印的 Cookie 只能被全站去水印读取。
            如果您的浏览器被设置为拒绝 Cookie，您仍然能够访问全站去水印的大多数网页。</view>
    </view>
</template>

<style scoped>
.container {
    height: 100vh;
    margin: 12px;
}
</style>
