<script lang="ts" setup>

</script>

<template>
    <view class="container">
        <br>全站去水印（以下简称“本程序”）是个人用于开发测试的一个小工具。
        <br>　　本程序尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本程序会按照本隐私权政策的规定使用和披露您的个人信息。但本程序将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本程序不会将这些信息对外披露或向第三方提供。本程序会不时更新本隐私权政策。
        您在同意本程序服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私政策属于本程序服务使用协议不可分割的一部分。
        <br>
        <br> 1. 如何收集和使用您的个人信息
        <br>
        本程序会遵循正当、合法、必要的原则，收集和使用您在使用本程序过程中主动提供或因使用本程序而产生的个人信息。如果我们要将您的个人信息用于本指引未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们将以合理的方式向您告知，并再次征得您的同意。
        <br> 提示您注意：由于不同的产品或服务所需的个人信息有所不同，我们还会在您使用具体产品或服务前通过页面提示、交互流程等方式征求您的同意，获取个人信息的范围以您同意的特定产品或服务的协议或规则为准。
        <br>
        <br> 1.1 如何收集您的个人信息
        <br> 在下列情形中，您可能需要向本程序提供或授权本程序收集相应服务所需的个人信息。如您拒绝提供部分功能或服务所需信息，您可能无法使用部分功能或服务。
        <br>
        <br>　　(1) 登录
        <br> 当你注册和登录本程序账户时，需要您提供有效的中国大陆手机号码，如果您拒绝提供，将无法注册本程序账户，并且无法使用本程序后续功能。
        <br>
        <br>　(2) 授权访问本地相册
        <br> 当您需要保存图片/视频时，我们将在征得您的单独同意后，获取您的相册（存储）权限。如果您拒绝提供，您将无法下载图文/视频内容。
        <br>
        <br>　(3) 授权访问粘贴板内容
        <br> 当您需要快捷粘贴功能时，我们将在征得您的同意后，获取您的粘贴板内容权限。如果您拒绝提供，您将无法快速粘贴内容，只能手动输入。
        <br>
        请注意，您公开发布的信息中可能会涉及您或他人的个人信息甚至个人敏感信息，如您在评价时选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。若您公开发布的信息中涉及他人个人信息的，您需在发布前征得他人的同意。
        <br>
        为了保证您的用户体验，在您使用本程序过程中，如果出现预期外异常时，本程序会记录相关异常，生成错误日志。同时，本程序会收集您的以下信息，包括您的设备型号、操作系统、唯一设备标识符、本程序版本号、接入网络的方式、类型和状态、设备名称Android
        ID、IMSI。
        <br>
        <br>　　1.2 如何使用您的个人信息
        <br>
        <br>　　本程序为了遵守国家法律法规及监管要求，以及向您提供服务及提升服务质量，或保障您的 账户安全，我行会在以下情形中使用您的信息。
        <br> (1)本程序会根据本隐私政策的约定并为实现本程序的服务或功能对所收集的您的个人信息进行使用。
        <br> (2)为了使您知晓使用本程序相关活动或使您进一步了解本程序相关服务，本程序会向您发送消息通知。您可以通过手机系统设置中的通知设置，关闭消息通知，也可以通过通知设置重新开启消息通知。
        <br> (3)为了保障服务的稳定性与安全性，本程序会将您的信息用于身份验证、安全防范、降低风险、存档和备份用途。
        <br>
        <br> (4)邀请您参与本程序服务或功能有关的客户调研。如您拒绝参加客户调研，不会影响您使用本程序的所有功能。
        <br>
        <br> (5)为了优化您的体验，当本程序发生预期外的异常时，本程序会对您的设备信息以及错误日志进行分析处理，以修复相关异常。
        <br>
        <br> (6)为了向您提供更优质的服务，本程序可能将您的个人信息用于体验改进、市场调查等用途，本程序可能根据前述信息向您进行一些个性化推荐，如果您不想收到此类内容，您可以在本程序“我的 - 设置 - 关于族谱 -
        个性化管理”中关闭此类内容推送。
        <br>
        <br> (7)根据法律法规或监管要求向相关部门进行报告。
        <br>
        <br> 2. Cookie的使用
        <br>
        (1)在您未拒绝接受cookies的情况下，本程序会在您的移动设备上设定或取用cookies，以便您能登录或使用依赖于cookies的本程序平台服务或功能。本程序使用cookies可为您提供更加周到的个性化服务，包括推广服务。
        <br> (2)您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本程序网络服务或功能。
        <br>
        <br> (3) 通过本程序所设cookies所取得的有关信息，将适用本政策。
        <br>
        <br> 3. 如何共享、转让和公开披露您的个人信息
        <br>
        <br>　　3.1 共享
        <br>
        <br> 本程序不会向其他任何公司、组织和个人共享或转让您的个人信息，但以下情况除
        <br> 外:
        <br>
        <br> (1)事先获得您的明确同意:
        <br>
        <br> (2)根据法律法规规定，或按政府主管部门的强制性要求。
        <br>
        <br> (3)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息。
        <br> (4)如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
        <br>
        <br> 3.2 转让
        <br>
        <br> (1)事先获得您的明确同意;
        <br>
        <br> (2)根据法律法规规定，或按政府主管部门的强制性要求。
        <br>
        <br> 3.3 公开披露
        <br> (1)本程序不会公开披露您的个人信息，如确需披露，本程序会获取您的同意，并告知您披露个人信息的目的、类型:涉及敏感信息的还会告知敏感信息的内容，并事先征得您的明示同意。
        <br>
        <br> (2)在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，本程序可能会公开披露您的个人信息
        <br>
        <br> 4. 个人信息存储和交换
        <br> 本程序收集的有关您的信息和资料将保存在本程序及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本程序收集信息和资料所在地的境外并在境外被访问、存储和展示。
        <br>　　
        <br> 5. 个人信息安全
        <br> (1)本程序帐号均有安全保护功能，请妥善保管您的用户名及密码信息。本程序将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。
        <br> (2)在使用本程序网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情
        形下向他人提供。如您发现自己的个人信息泄密，尤其是本程序用户名及密码发生泄露， 请您立即联络本程序客服，以便本程序采取相应措施。
        <br>
        <br> 6.系统权限说明
        <br> 为保障本程序相关功能的实现与应用安全稳定的运行，部分功能可能需要您在您的设备上向本程序开启部分系统权限。
        <br> 请您注意，在本程序需要相关访问权限的时候会明确弹出权限申请弹窗，只有您同意了授权，本程序才会获取相关信息。
        <br>
        <br> 6.1 系统权限列表
        <br>
        <br> 本程序对需要获取的系统访问权限，以及使用目的和场景，在以下目录中列明。

        <br>　　
        <br> (1)存储
        <br>
        读取/保存设备文件，用于修改/设置头像、修改/设置背景图片、修改/设置家族圈头像、修改/设置家庭头像、时光日记发布图片/视频、家庭动态发布图片/视频、家族圈话题发布图片/视频、实名认证、宗亲会认证、个人/家庭相册上传照片/视频、保存海报、保存印象画册、保存人脉名片、以及缓存本程序使用过程产生的文本、图片、视频等功能。
        <br>
        <br> 拒绝授权后，上述功能可能无法使用。
        <br>
        <br> (2)设备状态
        <br>
        <br> 用于确定设备识别码，以保证账号登录的安全性。
        <br>
        <br> 6.2 撤回您的系统权限授权
        <br>
        <br> 您可以通过本程序“我的 - 设置 - 关于族谱 - 权限管理”操作来撤回您已经授权的系统权限。
        <br>
        <br>7.本隐私政策的更新
        <br> (1)本程序保留不时更新或修改本政策的权利。未经您明确同意，本程序不会减少您按照本政策所应享有的权利。
        <br> (2)当本隐私政策更新时，本程序会通过推送通知、应用内弹窗、官网公告通知等合理方式通知您，以便您能及时了解本隐私政策所做的任何变更。
        <br>
        <br>
        <br>8.个人信息安全投诉、举报渠道
        <br>
        <br>　　我方将根据相关法律法规严格保护您的个人信息，阻止您的个人信息泄露。如果您对您的个人信息安全感到担忧或者需要举报相关问题可以在本程序中“我的 - 设置 -
        个人信息安全投诉和举报”中进行投诉举报、或者拨打400-990-3919与我方联系，我方会及时解决您的问题。
        <br>
        <br>9.第三方 SDK 收集使用个人信息列表
        <br>
        为保障本程序相关功能（比如微信分享等功能）的实现与应用安全稳定的运行，我们的产品可能会包含由第三方提供的软件开发包（SDK）或我们可能会使用其他第三方产品/服务以实现前述目的。合作方可能有其独立的隐私政策和用户协议，我们建议您阅读并遵守第三方的用户协议及个人信息保护政策。
        <br>
        <br> 第三方 SDK 收集和处理信息等行为遵守其自身的隐私条款，而不适用于本政策。当您查看第三方创建的网页或使用第三方开发的应用程序时，这些第三方可能会放置他们自己的 Cookie 或使用其他技术手段，这些 Cookie
        或其他技术手段不受我们的控制，且它们的使用不受本政策的约束。为保障您的合法权益，如您发现这等 SDK 或其他类似的应用程序存在风险时，建议您立即终止相关操作并及时与我们取得联系。
        <br>
        <br> 为了向您提供更多服务、持续优化我们提供服务的稳定性、提升服务质量或者升级相关功能，我们可能会调整我们接入的第三方 SDK 并更新 SDK 目录。我们会严格遵守相关法律法规与监管要求，在接入 SDK 前评估第三方 SDK
        收集您的个人信息的合法性、正当性、必要性，以保护您的个人信息。以下为第三方 SDK 的具体信息：
        <br>
        <br> (1). 微信 SDK
        <br> 收集方式：SDK 自动收集
        <br> 收集的信息：手机 WIFI 信息、MAC 地址、手机 ID 信息
        <br> 业务功能和使用目的：支持微信授权登录、微信分享、微信支付、检测支付环境是否安全
        <br>使用场景：1、登录页面勾选“已阅读并同意《用户协议》和《隐私协议》”并点击“微信登录”时 2、已登录状态下，对特定页面进行微信/微信朋友圈分享时 3、已登录状态下，进行微信支付时
        <br>
        <br> (2)七牛云SDK
        <br> 收集方式：SDK 自动收集
        <br> 收集的信息：设备标识符（IDFA）、设备基本配置信息（CPU、内存、屏幕、型号、操作系统）、运营商信息、设备硬件信息、网络信息（WIFI及蜂窝网络信息、IP地址、时间戳）、应用包名、版本信息
        <br>业务功能和使用目的：视频播放
        <br>使用场景：播放本地/网络视频
        <br>
     
    <br>收集方式：无
    <br>收集的信息：无
    <br>业务功能和使用目的：辅助开发
    <br>使用场景：APP 组件通信
    <br>
    <br>注：
    <br>隐私政策版本更新日期：2023年【04】月【06】日
    <br>隐私政策版本生效日期：2023年【04】月【06】日
    <br>
</view></template>

<style scoped>
.container {
    height: 100vh;
    margin: 12px;
}
</style>
